Autodesk.Navisworks.Api.Plugins.ClashResultActionPlugin
A plugin for implementing an action to apply to clash results.

Autodesk.Navisworks.Api.Plugins.ClashResultActionPlugin.#ctor
Default constructor.

Autodesk.Navisworks.Api.Plugins.ClashResultActionPlugin.BeginExecute


Autodesk.Navisworks.Api.Plugins.ClashResultActionPlugin.CanExecute(Autodesk.Navisworks.Api.SavedItem)
Test whether the item is in a state that is appropriate to use this plugin.

Autodesk.Navisworks.Api.Plugins.ClashResultActionPlugin.EndExecute


Autodesk.Navisworks.Api.Plugins.ClashResultActionPlugin.ExecuteAction(Autodesk.Navisworks.Api.SavedItem)


Autodesk.Navisworks.Api.Plugins.ClashResultActionPlugin.SupportsMultipleItems
If false is returned then the plugin will only be available to be called
when just a single item is selected in the clash UI Results list.